Repository: CofficLab/GitOK
Catalog: Packages/PluginGitUserSettings/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Add New Preset
zh_hans: 添加新预设
zh_hk: 新增預設

source: Applied User Info
zh_hans: 已应用用户信息
zh_hk: 已套用使用者資訊

source: Apply
zh_hans: 应用
zh_hk: 套用

source: Author Identity
zh_hans: 作者身份
zh_hk: 作者身份

source: Commit Signing
zh_hans: 提交签名
zh_hk: 提交簽名

source: Commit with identity
zh_hans: 以身份提交
zh_hk: 以身份提交

source: Configure the name and email used on every commit.
zh_hans: 配置每次提交使用的姓名与邮箱。
zh_hk: 配置每次提交使用的姓名與郵箱。

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Delete this preset
zh_hans: 删除此预设
zh_hk: 刪除此預設

source: Edit settings
zh_hans: 编辑设置
zh_hk: 編輯設置

source: Email
zh_hans: 邮箱
zh_hk: 郵箱

source: Enter email
zh_hans: 输入邮箱
zh_hk: 輸入電子郵件

source: Enter username
zh_hans: 输入用户名
zh_hk: 輸入使用者名稱

source: Existing Presets
zh_hans: 已有预设
zh_hk: 既有預設

source: Git config is updated safely.
zh_hans: Git 配置被安全更新。
zh_hk: Git 配置被安全更新。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Name
zh_hans: 姓名
zh_hk: 姓名

source: New commits carry the configured author.
zh_hans: 新提交携带配置的作者。
zh_hk: 新提交攜帶配置的作者。

source: No Project
zh_hans: 无项目
zh_hk: 無專案

source: Open a project to apply git user info.
zh_hans: 打开项目以应用 Git 用户信息。
zh_hk: 開啟專案以套用 Git 使用者資訊。

source: Optionally sign commits with your GPG or SSH key.
zh_hans: 可选地使用 GPG 或 SSH 密钥为提交签名。
zh_hk: 可選地使用 GPG 或 SSH 密鑰為提交簽名。

source: Per-repository identities override the global default.
zh_hans: 仓库级身份可覆盖全局默认。
zh_hk: 倉庫級身份可覆蓋全局默認。

source: Repo Overrides
zh_hans: 仓库覆盖
zh_hk: 倉庫覆蓋

source: Save failed: %@
zh_hans: 保存失败：%@
zh_hk: 儲存失敗：%@

source: Saved User Preset
zh_hans: 已保存用户预设
zh_hk: 已儲存使用者預設

source: Signing
zh_hans: 签名
zh_hk: 簽名

source: Update name, email, or signing key.
zh_hans: 更新姓名、邮箱或签名密钥。
zh_hk: 更新姓名、郵箱或簽名密鑰。

source: User Info
zh_hans: 用户信息
zh_hk: 使用者資訊

source: Username
zh_hans: 用户名
zh_hk: 使用者名稱

source: Write config
zh_hans: 写入配置
zh_hk: 寫入配置

source: Your Git identity, set once, used everywhere.
zh_hans: 你的 Git 身份，一次设置，处处使用。
zh_hk: 你的 Git 身份，一次設置，處處使用。

source: fields
zh_hans: 字段数
zh_hk: 字段數

source: identity
zh_hans: 身份
zh_hk: 身份
